app/views/artists/show.html.erb

SELECT "genres".* FROM "genres" INNER JOIN "artist_genres" ON "genres"."id" = "artist_genres"."genre_id" WHERE "artist_genres"."artist_id" = $1  [["artist_id", 1]]
---
			<li class="bio_item"><em>Genres: </em>
			<% @artist.genres.each do |genre| %>