app/views/record_labels/show.html.erb

<h3>All Artists</h3>
<% @record_label.artists.each do |artist| %>
---
SELECT "artists".* FROM "artists" WHERE "artists"."record_label_id" = $1  [["record_label_id", 1]]