app/views/albums/_artist_albums.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = $1  [["artist_id", 1]]
---
<h3>albums</h3>
<% artist.albums.each do |album| %>