app/views/albums/show.html.erb

SELECT "songs".* FROM "songs" WHERE "songs"."album_id" = $1  [["album_id", 18]]
---
<h3>songs</h3>
<% @album.songs.each do |song| %>