app/controllers/albums_controller.rb

  def create
    artist = Artist.find(params[:artist_id])
    album = Album.new(album_params)
    album.artist = artist

    if album.save
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "albums" ("title", "release_year", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Doobie doobs"], ["release_year", "2005"], ["description", "scooby dooby doo"], ["created_at", "2015-05-26 17:01:32.685203"], ["updated_at", "2015-05-26 17:01:32.685203"]]

  def update
    album = Album.find(params[:id])
    if album.update_attributes(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT 1  [["id", 17]]
UPDATE "albums" SET "description" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["description", "This album was created at the height of SNEEEEEWWWWWW's career. brilliant work"], ["updated_at", "2015-05-26 17:48:42.380680"], ["id", 17]]

  def destroy
    album = Album.find(params[:id])
    album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT 1  [["id", 13]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 13]]