app/controllers/artists_controller.rb

  def create
    artist = Artist.new(artist_params)
    if artist.save
---
INSERT INTO "artists" ("stage_name", "birth_name", "age", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    artist = Artist.find(params[:id])
    if artist.update_attributes(artist_params)
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "artists" SET "stage_name" = $1, "age" = $2, "updated_at" = $3 WHERE "artists"."id" = $4  [["stage_name", "Gnarly Gnarlology"], ["age", 35], ["updated_at", "2015-05-26 23:21:59.140752"], ["id", 3]]

  def destroy
    artist = Artist.find(params[:id])
    artist.destroy
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 3]]