app/controllers/artist_genres_controller.rb

  def edit
    @artist = Artist.find(params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", nil]]

  def update
    artist = Artist.find(params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", 3]]