app/controllers/genres_controller.rb

  def show
    @genre = Genre.find(params[:id])
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    genre = Genre.create(genre_params)
---
INSERT INTO "genres" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Blooooooz"], ["description", "Good when you're feelin a'down low"], ["created_at", "2015-05-25 00:48:08.922249"], ["updated_at", "2015-05-25 00:48:08.922249"]]

  def update
    genre = Genre.find_or_create_by(genre_params)
---
INSERT INTO "genres" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Blooooooz"], ["description", "Good when you're feelin a'crazy"], ["created_at", "2015-05-25 01:00:12.241670"], ["updated_at", "2015-05-25 01:00:12.241670"]]

  def destroy
    genre = Genre.find(params[:id])
    genre.destroy
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT 1  [["id", 8]]
DELETE FROM "genres" WHERE "genres"."id" = $1  [["id", 8]]