app/controllers/record_labels_controller.rb

SELECT "record_labels".* FROM "record_labels"
---
  def index
    @record_labels = RecordLabel.all

SELECT  "record_labels".* FROM "record_labels" WHERE "record_labels"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @record_label = RecordLabel.find(params[:id])

INSERT INTO "record_labels" ("name", "founding_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "gobbledygook records"], ["founding_date", "1955"], ["created_at", "2015-05-24 23:28:16.939179"], ["updated_at", "2015-05-24 23:28:16.939179"]]
---
  def create
    record_label = RecordLabel.find_or_create_by(record_label_params)

SELECT  "record_labels".* FROM "record_labels" WHERE "record_labels"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @record_label = RecordLabel.find(params[:id])

SELECT  "record_labels".* FROM "record_labels" WHERE "record_labels"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "record_labels" SET "name" = $1, "updated_at" = $2 WHERE "record_labels"."id" = $3  [["name", "Shoobie Shoobie Farbo"], ["updated_at", "2015-05-24 23:46:46.579221"], ["id", 3]]
---
  def update
    record_label = RecordLabel.find(params[:id])
    if record_label.update_attributes(record_label_params)

SELECT  "record_labels".* FROM "record_labels" WHERE "record_labels"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "record_labels" WHERE "record_labels"."id" = $1  [["id", 3]]
---
  def destroy
    record_label = RecordLabel.find(params[:id])
    record_label.destroy