app/controllers/songs_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT 1  [["id", 18]]
INSERT INTO "songs" ("title", "lyrics", "album_id", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    album = Album.find(params[:album_id])
    song = album.songs.build(song_params)
    song.artist = album.artist

    if song.save

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 12]]
UPDATE "songs" SET "lyrics" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["lyrics", "Having a happy bleeping christmas you awesome hole!!"], ["updated_at", "2015-05-26 23:43:13.750160"], ["id", 12]]
---
  def update
    song = Song.find(params[:id])
    if song.update_attributes(song_params)

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 12]]
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 12]]
---
  def destroy
    song = Song.find(params[:id])
    artist = song.artist
    album = song.album
    song.destroy